{
  "sections": [
    {
      "id": 1,
      "section": "cps_intro",
      "section_display": "CPS介绍",
      "title": "CPS介绍",
      "content": "待填写内容",
      "image_url": "",
      "order": 0
    },
    {
      "id": 2,
      "section": "cps_importance",
      "section_display": "CPS重要性",
      "title": "CPS重要性",
      "content": "待填写内容",
      "image_url": "",
      "order": 1
    },
    {
      "id": 3,
      "section": "measurement_intro",
      "section_display": "测量部分介绍",
      "title": "测量部分",
      "page_title": "整体介绍",
      "content": "针对合作解决问题研究中行为定义模糊、人工编码成本高、跨任务与跨研究可复用性不足等问题，本项目系统开展了基于过程数据的协作解决问题行为特征提取与自动编码方法研究。在编码体系构建方面，以PISA 2015合作解决问题能力框架为理论基础，结合真实协作日志与多轮专家讨论，构建了覆盖协作互动与问题解决全过程的多层级行为编码规则体系，明确行为的操作性定义、判定标准与时间边界，显著提升编码的一致性与可解释性。在人工标注方面，采用多轮交叉标注与一致性检验机制，对大规模过程数据进行精细化人工编码，形成高质量训练语料，为模型学习提供可靠监督信号。在自动编码方法方面，项目围绕自然语言、行为序列与时间信息的联合建模，探索多种自动编码策略，逐步实现从文本级、事件级到序列级的行为识别，显著降低人工成本并提升编码效率。相关研究在多个真实数据集上验证了自动编码方法的有效性与稳定性，为后续行为模式分析、过程建模与实时干预提供了标准化、可扩展的基础表征支撑，也为CPS行为研究从\"可描述\"迈向\"可计算\"奠定了关键方法基础。",
      "short_content": "编码规则构建与人工标注\n自动编码",
      "image_url": "",
      "order": 2
    },
    {
      "id": 4,
      "section": "analysis_intro",
      "section_display": "分析部分介绍",
      "title": "分析部分",
      "page_title": "整体介绍",
      "content": "围绕协作解决问题过程中行为的时序结构、动态演化机制及其与协作成效之间的关系，本项目进一步系统开展了基于过程数据的分析与建模研究，形成了一条由描述性分析向机制解释与预测建模逐步深化的研究主线。相关研究以高时间分辨率的协作日志为基础，突破仅依赖行为频率或结果标签的传统分析范式，重点关注行为顺序、转移结构、阶段划分及其调控机制在CPS中所发挥的关键作用。项目综合运用序列聚类、滞后序列分析、认知网络分析、隐马尔可夫模型以及回归与注意力机制等多种建模方法，从不同分析粒度刻画CPS行为的内在组织方式。一方面，通过显式建模行为之间的转移关系与网络结构，揭示协作过程中由理解、规划到执行与监控的典型动态路径；另一方面，通过隐状态建模与用户画像分析，挖掘表层行为背后潜在的阶段结构与策略差异，揭示高低水平协作在状态复杂性、自我调控能力及策略灵活性方面的本质差别。多项研究结果一致表明，协作绩效差异并非主要来源于行为数量或单一技能频次，而更深层地体现在行为如何被组织、如何发生转移以及是否形成有效的计划—执行—反馈闭环。项目进一步验证了早期过程特征对最终协作结果的预测价值，为基于过程数据的协作诊断、阶段识别与精准干预提供了理论依据与模型支持，显著拓展了CPS研究在机制解释与应用层面的深度。",
      "short_content": "预测类\n描述类",
      "image_url": "",
      "order": 3
    },
    {
      "id": 5,
      "section": "intervention_intro",
      "section_display": "干预部分介绍",
      "title": "干预部分",
      "page_title": "整体介绍",
      "content": "针对合作问题解决干预缺乏针对性、触发条件模糊、干预时机滞后、效果难量化等问题，本项目在前期自动编码模型和行为模式分析的基础上，构建了个性化协作解决问题干预方案并开发了专用的干预任务。干预方案以PISA 2015合作解决问题能力构成框架为依据，聚焦协作互动与问题解决两大核心维度，创新设计全过程干预与节点式干预双模式：全过程干预通过文本识别与时间戳分析，实时纠正长时间不发言、侮辱性言论等不规范行为；节点式干预基于前期实证数据确定13分钟、20分钟关键节点及四类编码量化阈值，结合实验组类型提供差异化策略引导。在干预任务开发方面，构建了1个对照组与3 个实验组的对比框架，对照组采用原始MGF任务，实验组分别聚焦协作能力、解决问题能力及双维度能力提升，设计标准化实施流程，采用多次编码机制确保数据准确性，构建涵盖过程性数据与成绩数据的完整记录体系，明确干预相关数据的标注规范与存储格式。该方案实现了干预从经验驱动向数据驱动、同质化覆盖向精准化适配的转变，任务已完成demo设计，为合作解决问题能力的科学培养提供了可操作、可复制的实践范式，也为干预效果量化评估提供了标准化工具。",
      "short_content": "干预方案设计\ndemo介绍",
      "image_url": "",
      "order": 4
    }
  ]
}

